import numpy as np


####################仅仅是一个示例###################################


# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[535.2642,  -0.2035, 650.7198],
                                         [0, 535.3167, 361.6307],
                                         [0, 0, 1]
                                        ])
        # 右相机内参
        self.cam_matrix_right = np.array([[529.9318, 0.0706, 650.2463],
                                          [0, 530.2521, 359.0737],
                                          [0, 0, 1]
                                        ])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[-0.0989, 0.1187, 0, -0.0003, -0.0617]])
        self.distortion_r = np.array([[-0.1068, 0.1372, 0.00013, 0.00006, -0.0751]])

        # 旋转矩阵
        self.R = np.array([[1.0000, 0.0010, -0.0029],
                           [-0.0010, 1.0000, -0.0004],
                           [0.0029, 0.0004, 1.0000]
                            ])

        # 平移矩阵
        self.T = np.array([-119.7704, -0.0828, 0.1993])

        # 焦距
        #self.focal_length = 859.367 # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]

        # 基线距离
        self.baseline = 119.7704 # 单位：mm， 为平移向量的第一个参数（取绝对值）

        


